{"sections":{"main":{"type":"main-page","settings":{}},"f87ad6f7-a446-4a7d-8187-e404f0ea4022":{"type":"page-header","disabled":true,"settings":{"page-header-title":"Heading","page-header-text":"Subheading","page-header-button-text":"Button Label","page-header-link":"\/","page-header-button-text2":"","page-header-link2":""}},"faqs_t94PFW":{"type":"faqs","blocks":{"accordion_Bpkm6z":{"type":"accordion","settings":{"title":"Where We Ship?","accordion-content":"<p>We ship to Canada, USA, United Kingdom, Australia, New Zealand, Netherlands, Hong Kong and Japan.<\/p><p>We do not ship to PO boxes or freight forwarders.<\/p>"}},"accordion_93LaM4":{"type":"accordion","settings":{"title":"Shipping Cost","accordion-content":"<p>We are testing our warehouses carriers rates and they use multiple carriers to see if they can reduce our shipping costs. We offer the following options: <\/p><p><strong>Canada<\/strong><\/p><p>Pick up in shop - Free (where available)<\/p><p>Standard (4-7 business days) – $12 CAD<\/p><p>Orders of $99+ (before tax) – Free standard shipping<\/p><p>Express (1-3 business days) - $25 CAD<\/p><p><\/p><p><strong>USA<\/strong><\/p><p>Standard (4-7 business days) – $15 USD<\/p><p>Orders of $99+ (before tax) – Free standard shipping<\/p><p><\/p><p><strong>Australia, New Zealand<\/strong><\/p><p>Express (3-7 business days) - $50 USD<\/p><p>United Kingdom, Netherlands, Hong Kong and Japan<\/p><p>Express (3-7 business days) - $50 USD<\/p><p>Great news! Kit and Ace takes care of all clearance and duties charges for orders shipped to the US.<\/p><p> <em>*Please note, the recipient is responsible for any taxes, duties and customs charges for orders outside of Canada and the US<\/em>. <em>Kit and Ace does not determine these charges or receive the funds collected. Fedex may reach out for you to fill out a 5106 form to release your order.<\/em><\/p><p>Shipping charges are non-refundable.<\/p><p>Shipping times start once an order has left our warehouse. Orders are generally processed and shipped within two to three business days (pending credit verification). Processing times do not include Saturdays, Sundays, Wednesdays, Thursdays or holidays. Delivery times do not include Saturdays, Sundays and holidays. Due to high volume periods during our promotional events, order processing times may take three to seven business days.<\/p>"}},"accordion_kBCm9m":{"type":"accordion","settings":{"title":"Order Online, Pick up in Shop","accordion-content":"<p>We offer guests the option of ordering from their local shop and picking up as soon as the team can prepare the order. There is no shipping cost when ordering from your local shop.<br\/><br\/>Your order will be held for 5 days from the receipt of the Ready for Pickup email. During that time, we'll send you a reminder email after 2 days.<\/p><p>Orders not picked up within this timeframe will be automatically cancelled and the authorization automatically be removed from your payment method in 5-7 business days. The exact timeframe for removal is determined by your card's issuing bank.<\/p><p>We do offer the option for someone to pickup the order on your behalf. Please make sure they have the order confirmation email with them (mobile or a printed copy) and your photo ID to present on your behalf.<\/p><p>If you would like to email the shop, our shop contact information can be located <a href=\"https:\/\/kit-and-ace.myshopify.com\/pages\/store-locator\" title=\"Shops\">here<\/a><\/p>"}},"accordion_JAqtpj":{"type":"accordion","settings":{"title":"Tracking Your Order","accordion-content":"<p>Once a purchase has been made on kitandace.com, an email confirmation will be sent to the email address provided at checkout. Another email containing your tracking number will be sent once your order has been shipped and is en route to your door. Your tracking number is also available in your account.<\/p>"}}},"block_order":["accordion_Bpkm6z","accordion_93LaM4","accordion_kBCm9m","accordion_JAqtpj"],"disabled":true,"settings":{"accordion-section-title":"Shipping","accordion-section-content":"","faq_block_button_text":"","faq_block_button_link":""}},"faqs_Vn4JH3":{"type":"faqs","blocks":{"accordion_PQGmiP":{"type":"accordion","settings":{"title":"Order Changes & Cancellations","accordion-content":"<p>We process orders very quickly and therefore are not able to modify or cancel any orders that have been placed and confirmed. Please ensure the correct size, colour and product(s) are in the cart and carefully review all shipping details before submitting an order. Kit and Ace is only responsible for processing and fulfilling orders according to the original submission with the information provided by the customer at the time of purchase.<\/p>"}},"accordion_ir77Tq":{"type":"accordion","settings":{"title":"Lost or Damaged Items","accordion-content":"<p>Contact <a href=\"mailto:support@kitandace.com\">support@kitandace.com <\/a>immediately with any issues or concerns regarding your order – include a photo in the email if it is regarding a damaged item. Please note Kit and Ace is not liable for lost or missing packages that show successful delivery to the address submitted on the order.<\/p>"}},"accordion_BtFU9A":{"type":"accordion","settings":{"title":"How to Return","accordion-content":"<p>Click to start your <a href=\"https:\/\/kitandace.loopreturns.com\/#\/\" target=\"_blank\" title=\"https:\/\/kitandace.loopreturns.com\/#\/\">return process<\/a><\/p>"}},"accordion_x4yzAQ":{"type":"accordion","settings":{"title":"Return Policy: North America","accordion-content":"<p><strong>Regular Priced Merchandise:<\/strong><\/p><p>You have 30 days from the date your order is received to complete a return in store or process a return request online (*please note, the return shipment must be scanned by the courier before the end of the 30-day period).<\/p><p>Returns made in our shop locations are always free.<\/p><p>Returns mailed back to Kit and Ace have a flat rate return shipping fee of $8 CAD that will be automatically deducted from your refund. This fee applies to the entire return, not per item. To avoid additional shipping fees, please ensure all items are returned in the same package.<\/p><p>Click to start your <a href=\"https:\/\/kitandace.loopreturns.com\/#\/\" target=\"_blank\" title=\"https:\/\/kitandace.loopreturns.com\/#\/\">return process<\/a><\/p><p>Returns past the 30-day period will not be accepted and are considered final sale.<\/p><p>All garments must be unworn, unaltered, unwashed, undamaged and have both the original hang tag and blue care content label attached. We do not offer price adjustments at any time. Socks and underwear are not eligible for returns.<\/p><p><\/p><p><strong>Markdown Merchandise:<\/strong><\/p><p>All marked down items —and markdown events including End of Season Sale and Boxing Day Sale— are final sale and not eligible for an exchange, refund, credit note, or price adjustment.<\/p><p>Any sale items that are specifically marked final sale are not eligible for an exchange, refund, credit note, or price adjustments.<\/p><p><\/p><p><strong>Exchanges:<\/strong><\/p><p>We do not offer exchanges by mail. You can return your regular-priced merchandise for a refund and re-order the correct item\/size to be mailed back to you, or visit a local shop to complete the exchange.<\/p><p><br\/><strong>Gift Purchases:<\/strong><\/p><p>Gift purchases (excluding final sale items) can be exchanged or returned for a gift card at any shop within 30 days. Online gift purchases (excluding final sale items) can be returned and refunded to the original payment method with the original receipt or to a gift card within 30 days.<\/p><p>Please contact <a href=\"mailto:return@kitandace.com\">return@kitandace.com<\/a> for support with online gift purchases.<\/p><p>Gift cards may not be redeemed for cash or refunded unless required by law.<\/p><p><\/p><p><strong>Gift Receipts:<\/strong><\/p><p>Items returned with a gift receipt will be eligible for exchange or store credit in the form of a gift card only. <\/p><p>No refunds or exchanges can be processed without a valid receipt or gift receipt. <\/p>"}},"accordion_m9fGjr":{"type":"accordion","settings":{"title":"Return Process: North America","accordion-content":"<p>To make a return to one of our Canadian shops, please visit our <a href=\"https:\/\/www.kitandace.com\/ca\/en\/shoplocations\" target=\"_blank\">locations<\/a> page to find the shop nearest you. If you do not live near one of our shops or would prefer to mail your return for an $8 CAD shipping fee, please follow the steps below:<\/p><p>click to start your <a href=\"https:\/\/kitandace.loopreturns.com\/#\/\" target=\"_blank\" title=\"https:\/\/kitandace.loopreturns.com\/#\/\">return process<\/a><\/p><p><\/p><p>Once you have completed these steps, you will receive an email confirming that your return has been set up and authorized. You can access your prepaid FedEx shipping label (valid for 7 days) through the link provided in the email.<\/p><p>Place the item(s) in the original packaging.<\/p><p>Print and attach the shipping label.<\/p><p>Please drop off your return package at the nearest <a href=\"https:\/\/www.fedex.com\/locate\/index.html?locale=#start\" target=\"_blank\">FedEx Ground<\/a> location.<\/p><p>Once the return has been received at the warehouse and approved (items are in perfect condition with tags attached) we will email you to confirm receipt. Your return will then be processed by our warehouse which may take up to 3-10 business days. Once processed, a refund will be issued to the original method of payment. This may take 3-10 business days dependent on your financial institution to appear on your bank statement and up to 30 days if the original method of payment was PayPal on their end.  <\/p><p>Online orders from countries outside of Canada, are not eligible to be returned in a Canadian shop.<\/p><p>Questions about your return? Email <a href=\"mailto:return@kitandace.com\">return@kitandace.com<\/a><\/p>"}},"accordion_PJA3ec":{"type":"accordion","settings":{"title":"Return Policy: International","accordion-content":"<p><strong>Regular Priced Merchandise:<\/strong><\/p><p>You have up to 30 days from the date you receive your order to email <a href=\"mailto:return@kitandace.com\">return@kitandace.com<\/a> to request a return label and ship the return package.<\/p><p>Returns received outside of the 30-day period will not be accepted and are considered final sale.<\/p><p>All garments must be unworn, unaltered, unwashed, undamaged and have both the original hang tag and blue care content label attached. We do not offer price adjustments at any time.<\/p><p><\/p><p><strong>Markdown Merchandise:<\/strong><\/p><p>All marked down items —and markdown events including End of Season Sale and Boxing Day Sale— are final sale and not eligible for an exchange, refund, credit note, or price adjustment.<\/p><p>Any sale items that are specifically marked final sale are not eligible for an exchange, refund, credit note, or price adjustments.<\/p><p><strong><br\/>Exchanges:<\/strong><\/p><p>We do not offer exchanges by mail.<\/p><p>You can return your regular-priced merchandise for a refund and re-order the correct item\/size to be mailed back to you, or visit a local shop to complete the exchange.<\/p><p><\/p><p><strong>Gift Purchases:<\/strong><\/p><p>Online gift purchases (excluding final sale items) can be returned and refunded to the original payment method with the original receipt or to a gift card within 30 days.<\/p><p>Please contact <a href=\"mailto:return@kitandace.com\">return@kitandace.com<\/a> for support with online gift purchases.<\/p><p><\/p><p>Gift cards may not be redeemed for cash or refunded unless required by law.<\/p><p>Items Not Eligible for Return: Socks and underwear, Lifestyle products, Tailored, hemmed, and monogrammed items, Gift cards and Shipping charges. We do not accept partial returns on promotional orders.<\/p>"}},"accordion_A3qUgh":{"type":"accordion","settings":{"title":"Return Process: International","accordion-content":"<p>To process a return from the United Kingdom, Australia, New Zealand, Japan, Hong Kong, or the Netherlands:<\/p><p>1. Please e-mail <a href=\"mailto:return@kitandace.com\" target=\"_blank\" title=\"mailto:return@kitandace.com\">return@kitandace.com<\/a> to request your return authorization number and let us know which item(s) will be sent back for return, and what the reason for the return is.<\/p><p>2. Once you have emailed us to process your return request, you will receive an email with a return authorization number within two business days.<\/p><p>3. We do not provide return shipping labels for orders shipped to the UK, Australia, New Zealand, Japan, Hong Kong or the Netherlands. Please contact your local post office to purchase one.<\/p><p>4. Write your return authorization number along with the customs code (below) on the outside of your package and then ship the package to:<\/p><p>Kit and Ace Technical Apparel Inc.<br\/>Kit and Ace Returns (Unity 3PL)<br\/>415 Milner Ave<br\/>Scarborough, Ontario M1B 2L1<br\/>Canada<br\/>Canadian Goods Returning<br\/>HS Tariff No. 9814.00.00.93<\/p><p>5. Once the return has been received at the warehouse and approved (items are in perfect condition with tags attached) we will email you to confirm receipt. Your return will then be processed by our warehouse which may take up to 3-10 business days. Once processed, a refund will be issued to the original method of payment. This may take 3-10 business days dependent on your financial institution to appear on your bank statement and up to 30 days if the original method of payment was PayPal on their end.  <\/p><p>*Your Return Authorization Number must be referenced on the package to ensure a refund<\/p><p>Questions about your return? Email <a href=\"mailto:return@kitandace.com\" target=\"_blank\" title=\"mailto:return@kitandace.com\">return@kitandace.com<\/a><\/p>"}}},"block_order":["accordion_PQGmiP","accordion_ir77Tq","accordion_BtFU9A","accordion_x4yzAQ","accordion_m9fGjr","accordion_PJA3ec","accordion_A3qUgh"],"disabled":true,"settings":{"accordion-section-title":"Returns","accordion-section-content":"","faq_block_button_text":"","faq_block_button_link":""}}},"order":["main","f87ad6f7-a446-4a7d-8187-e404f0ea4022","faqs_t94PFW","faqs_Vn4JH3"]}